🚀&nbsp; env0 had composed a PR Plan for environment [Terraform Example / production ](https://app.env0.com/p/7e42bc84-96b5-4134-afcb-48bf9ca14ae5/environments/2f99ba14-db12-4356-9d1d-b6186bbcdbb2?organizationId=1649446b-b80b-4162-881c-2e5d319c8e50):
```
Plan: 3 to add, 1 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:


  # module.heritage[0].aws_rds_cluster.face_database will be updated in-place
!   resource "aws_rds_cluster" "face_database" {
        id                                    = "facial-recognition-terraform-example"
        tags                                  = {}
        # (46 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shared_security_group.aws_instance.api_server[0] will be created
+   resource "aws_instance" "api_server" {
+       ami                                  = "ami-02a95139d1d364420"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = true
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       enable_primary_ipv6                  = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t4g.nano"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = "subnet-0a1b287732e8ad0b7"
+       tags                                 = {
+           "Environment" = "production"
+           "ManagedBy"   = "terraform"
+           "Name"        = "api-server"
+           "Project"     = "platform-services"
+           "Team"        = "platform"
        }
+       tags_all                             = {
+           "Environment" = "production"
+           "ManagedBy"   = "terraform"
+           "Name"        = "api-server"
+           "Project"     = "platform-services"
+           "Team"        = "platform"
        }
+       tenancy                              = (known after apply)
+       user_data                            = "146523b0a5c60264146991ccc0576cc1b24e25c3"
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)

+       root_block_device {
+           delete_on_termination = true
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           tags_all              = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = 8
+           volume_type           = "gp3"
        }
    }

  # module.shared_security_group.aws_security_group.internet_access[0] will be created
+   resource "aws_security_group" "internet_access" {
+       arn                    = (known after apply)
+       description            = "Allow outbound internet access"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow all outbound traffic"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "HTTP access"
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "SSH access"
+               from_port        = 22
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 22
            },
        ]
+       name                   = "internet-access"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment" = "production"
+           "ManagedBy"   = "terraform"
+           "Name"        = "internet-access"
+           "Project"     = "platform-services"
+           "Purpose"     = "General outbound access"
+           "Team"        = "platform"
        }
+       tags_all               = {
+           "Environment" = "production"
+           "ManagedBy"   = "terraform"
+           "Name"        = "internet-access"
+           "Project"     = "platform-services"
+           "Purpose"     = "General outbound access"
+           "Team"        = "platform"
        }
+       vpc_id                 = "vpc-02901bcbb89561298"
    }

  # module.shared_security_group.random_id.suffix[0] will be created
+   resource "random_id" "suffix" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+   shared_sg_api_server_id           = (known after apply)
+   shared_sg_manual_instance_command = (known after apply)
+   shared_sg_security_group_id       = (known after apply)
```
</details>


```
Monthly cost change for overmindtech/terraform-example/env0_tf_plan.json
Amount:  +$4 ($376 → $380)
Percent: +1%
```
<details>
<summary>Cost Estimation Details</summary>

```diff
Key: * usage cost, ~ changed, + added, - removed

──────────────────────────────────
Project: overmindtech/terraform-example/env0_tf_plan.json

+ module.shared_security_group.aws_instance.api_server[0]
  +$4

+     Instance usage (Linux/UNIX, on-demand, t4g.nano)
      +$3

+     root_block_device
    
+         Storage (general purpose SSD, gp3)
          +$0.74

Monthly cost change for overmindtech/terraform-example/env0_tf_plan.json
Amount:  +$4 ($376 → $380)
Percent: +1%

──────────────────────────────────
Key: * usage cost, ~ changed, + added, - removed

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

139 cloud resources were detected:
∙ 45 were estimated
∙ 92 were free
∙ 2 are not supported yet, see https://infracost.io/requested-resources:
  ∙ 1 x aws_cloudfront_monitoring_subscription
  ∙ 1 x aws_cloudwatch_query_definition

Infracost estimate: Monthly estimate increased by $4 ↑
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━┓
┃ Changed project                                    ┃ Baseline cost ┃ Usage cost* ┃ Total change ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━┫
┃ overmindtech/terraform-example/env0_tf_plan.json   ┃           +$4 ┃           - ┃    +$4 (+1%) ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━┛
```
</details>



[Full PR Plan logs on env0](https://app.env0.com/p/7e42bc84-96b5-4134-afcb-48bf9ca14ae5/environments/2f99ba14-db12-4356-9d1d-b6186bbcdbb2/deployments/6849f177-5b6b-4caa-9264-8635888daad2?organizationId=1649446b-b80b-4162-881c-2e5d319c8e50)
